#### 📖 Terraform Plan ('infra/resources/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.commons.azurerm_dns_a_record.api_trial_pagopa_it will be updated in-place
  ~ resource "azurerm_dns_a_record" "api_trial_pagopa_it" {
        id                  = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-net-rg-01/providers/Microsoft.Network/dnsZones/trial.pagopa.it/A/api"
        name                = "api"
      ~ records             = [
          - "172.213.194.81",
        ] -> (known after apply)
        tags                = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "Owner"          = "TRIAL"
            "Source"         = "https://github.com/pagopa/trial-system"
        }
        # (4 unchanged attributes hidden)
    }

  # module.commons.azurerm_network_security_group.nsg_apim will be destroyed
  # (because azurerm_network_security_group.nsg_apim is not in configuration)
  - resource "azurerm_network_security_group" "nsg_apim" {
      - id                  = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-routing-rg-01/providers/Microsoft.Network/networkSecurityGroups/ts-p-itn-apim-nsg" -> null
      - location            = "italynorth" -> null
      - name                = "ts-p-itn-apim-nsg" -> null
      - resource_group_name = "ts-p-itn-routing-rg-01" -> null
      - security_rule       = [
          - {
              - access                                     = "Allow"
              - description                                = ""
              - destination_address_prefix                 = "VirtualNetwork"
              - destination_address_prefixes               = []
              - destination_application_security_group_ids = []
              - destination_port_range                     = "3443"
              - destination_port_ranges                    = []
              - direction                                  = "Inbound"
              - name                                       = "managementapim"
              - priority                                   = 100
              - protocol                                   = "Tcp"
              - source_address_prefix                      = "ApiManagement"
              - source_address_prefixes                    = []
              - source_application_security_group_ids      = []
              - source_port_range                          = "*"
              - source_port_ranges                         = []
            },
        ] -> null
      - tags                = {
          - "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          - "CreatedBy"      = "Terraform"
          - "Environment"    = "Prod"
          - "ManagementTeam" = "IO Platform"
          - "Owner"          = "TRIAL"
          - "Source"         = "https://github.com/pagopa/trial-system"
        } -> null
    }

  # module.commons.azurerm_private_dns_zone.privatelink_api_net will be destroyed
  # (because azurerm_private_dns_zone.privatelink_api_net is not in configuration)
  - resource "azurerm_private_dns_zone" "privatelink_api_net" {
      - id                                                    = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-net-rg-01/providers/Microsoft.Network/privateDnsZones/privatelink.azure-api.net" -> null
      - max_number_of_record_sets                             = 25000 -> null
      - max_number_of_virtual_network_links                   = 1000 -> null
      - max_number_of_virtual_network_links_with_registration = 100 -> null
      - name                                                  = "privatelink.azure-api.net" -> null
      - number_of_record_sets                                 = 2 -> null
      - resource_group_name                                   = "ts-p-itn-net-rg-01" -> null
      - tags                                                  = {} -> null

      - soa_record {
          - email         = "azureprivatedns-host.microsoft.com" -> null
          - expire_time   = 2419200 -> null
          - fqdn          = "privatelink.azure-api.net." -> null
          - host_name     = "azureprivatedns.net" -> null
          - minimum_ttl   = 10 -> null
          - refresh_time  = 3600 -> null
          - retry_time    = 300 -> null
          - serial_number = 1 -> null
          - tags          = {} -> null
          - ttl           = 3600 -> null
        }
    }

  # module.commons.azurerm_private_dns_zone_virtual_network_link.apim_link will be destroyed
  # (because azurerm_private_dns_zone_virtual_network_link.apim_link is not in configuration)
  - resource "azurerm_private_dns_zone_virtual_network_link" "apim_link" {
      - id                    = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-net-rg-01/providers/Microsoft.Network/privateDnsZones/privatelink.azure-api.net/virtualNetworkLinks/ts-p-itn-vnet-01" -> null
      - name                  = "ts-p-itn-vnet-01" -> null
      - private_dns_zone_name = "privatelink.azure-api.net" -> null
      - registration_enabled  = false -> null
      - resource_group_name   = "ts-p-itn-net-rg-01" -> null
      - tags                  = {} -> null
      - virtual_network_id    = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-net-rg-01/providers/Microsoft.Network/virtualNetworks/ts-p-itn-vnet-01" -> null
    }

  # module.commons.azurerm_private_endpoint.apim will be destroyed
  # (because azurerm_private_endpoint.apim is not in configuration)
  - resource "azurerm_private_endpoint" "apim" {
      - custom_dns_configs       = [] -> null
      - id                       = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-net-rg-01/providers/Microsoft.Network/privateEndpoints/ts-p-itn-apim-endpoint" -> null
      - location                 = "italynorth" -> null
      - name                     = "ts-p-itn-apim-endpoint" -> null
      - network_interface        = [
          - {
              - id   = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-net-rg-01/providers/Microsoft.Network/networkInterfaces/ts-p-itn-apim-endpoint.nic.2f4f7059-80c1-4717-832f-c8035e505c4a"
              - name = "ts-p-itn-apim-endpoint.nic.2f4f7059-80c1-4717-832f-c8035e505c4a"
            },
        ] -> null
      - private_dns_zone_configs = [
          - {
              - id                  = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-net-rg-01/providers/Microsoft.Network/privateEndpoints/ts-p-itn-apim-endpoint/privateDnsZoneGroups/private-dns-zone-group/privateDnsZoneConfigs/privatelink.azure-api.net"
              - name                = "privatelink.azure-api.net"
              - private_dns_zone_id = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-net-rg-01/providers/Microsoft.Network/privateDnsZones/privatelink.azure-api.net"
              - record_sets         = [
                  - {
                      - fqdn         = "ts-p-itn-apim-01.privatelink.azure-api.net"
                      - ip_addresses = [
                          - "10.30.2.20",
                        ]
                      - name         = "ts-p-itn-apim-01"
                      - ttl          = 10
                      - type         = "A"
                    },
                ]
            },
        ] -> null
      - resource_group_name      = "ts-p-itn-net-rg-01" -> null
      - subnet_id                = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-net-rg-01/providers/Microsoft.Network/virtualNetworks/ts-p-itn-vnet-01/subnets/ts-p-itn-pendpoints-snet-01" -> null
      - tags                     = {
          - "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          - "CreatedBy"      = "Terraform"
          - "Environment"    = "Prod"
          - "ManagementTeam" = "IO Platform"
          - "Owner"          = "TRIAL"
          - "Source"         = "https://github.com/pagopa/trial-system"
        } -> null

      - private_dns_zone_group {
          - id                   = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-net-rg-01/providers/Microsoft.Network/privateEndpoints/ts-p-itn-apim-endpoint/privateDnsZoneGroups/private-dns-zone-group" -> null
          - name                 = "private-dns-zone-group" -> null
          - private_dns_zone_ids = [
              - "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-net-rg-01/providers/Microsoft.Network/privateDnsZones/privatelink.azure-api.net",
            ] -> null
        }

      - private_service_connection {
          - is_manual_connection           = false -> null
          - name                           = "ts-p-itn-apim-endpoint" -> null
          - private_connection_resource_id = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-routing-rg-01/providers/Microsoft.ApiManagement/service/ts-p-itn-apim-01" -> null
          - private_ip_address             = "10.30.2.20" -> null
          - subresource_names              = [
              - "Gateway",
            ] -> null
        }
    }

  # module.commons.azurerm_public_ip.appgateway_public_ip must be replaced
-/+ resource "azurerm_public_ip" "appgateway_public_ip" {
      + fqdn                    = (known after apply)
      ~ id                      = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-routing-rg-01/providers/Microsoft.Network/publicIPAddresses/ts-p-itn-appgateway-pip-01" -> (known after apply)
      ~ ip_address              = "172.213.194.81" -> (known after apply)
      - ip_tags                 = {} -> null
        name                    = "ts-p-itn-appgateway-pip-01"
      ~ resource_group_name     = "ts-p-itn-routing-rg-01" -> "ts-p-itn-rg-external-01" # forces replacement
        tags                    = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "Owner"          = "TRIAL"
            "Source"         = "https://github.com/pagopa/trial-system"
        }
        # (8 unchanged attributes hidden)
    }

  # module.commons.azurerm_resource_group.rg_external will be created
  + resource "azurerm_resource_group" "rg_external" {
      + id       = (known after apply)
      + location = "italynorth"
      + name     = "ts-p-itn-rg-external-01"
      + tags     = {
          + "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Platform"
          + "Owner"          = "TRIAL"
          + "Source"         = "https://github.com/pagopa/trial-system"
        }
    }

  # module.commons.azurerm_resource_group.rg_routing will be destroyed
  # (because azurerm_resource_group.rg_routing is not in configuration)
  - resource "azurerm_resource_group" "rg_routing" {
      - id       = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-routing-rg-01" -> null
      - location = "italynorth" -> null
      - name     = "ts-p-itn-routing-rg-01" -> null
      - tags     = {
          - "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          - "CreatedBy"      = "Terraform"
          - "Environment"    = "Prod"
          - "ManagementTeam" = "IO Platform"
          - "Owner"          = "TRIAL"
          - "Source"         = "https://github.com/pagopa/trial-system"
        } -> null
    }

  # module.commons.azurerm_role_assignment.subs_asyn_staging_write_to_sbt must be replaced
-/+ resource "azurerm_role_assignment" "subs_asyn_staging_write_to_sbt" {
      ~ id                               = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-data-rg-01/providers/Microsoft.ServiceBus/namespaces/ts-trial-srvb/topics/ts-trial-topic-events/providers/Microsoft.Authorization/roleAssignments/d2dc7f52-4183-335e-681c-b65acf9abd35" -> (known after apply)
      ~ name                             = "d2dc7f52-4183-335e-681c-b65acf9abd35" -> (known after apply)
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/providers/Microsoft.Authorization/roleDefinitions/69a216fc-b8fb-44d8-bc22-1f3c2cd27a39" -> (known after apply)
      ~ scope                            = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-data-rg-01/providers/Microsoft.ServiceBus/namespaces/ts-trial-srvb/topics/ts-trial-topic-events" # forces replacement -> (known after apply) # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.commons.azurerm_role_assignment.subs_asyn_write_to_sbt must be replaced
-/+ resource "azurerm_role_assignment" "subs_asyn_write_to_sbt" {
      ~ id                               = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-data-rg-01/providers/Microsoft.ServiceBus/namespaces/ts-trial-srvb/topics/ts-trial-topic-events/providers/Microsoft.Authorization/roleAssignments/bba9764e-d494-eb2e-92dd-0749fe769cdb" -> (known after apply)
      ~ name                             = "bba9764e-d494-eb2e-92dd-0749fe769cdb" -> (known after apply)
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/providers/Microsoft.Authorization/roleDefinitions/69a216fc-b8fb-44d8-bc22-1f3c2cd27a39" -> (known after apply)
      ~ scope                            = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-data-rg-01/providers/Microsoft.ServiceBus/namespaces/ts-trial-srvb/topics/ts-trial-topic-events" # forces replacement -> (known after apply) # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.commons.azurerm_servicebus_topic.events must be replaced
-/+ resource "azurerm_servicebus_topic" "events" {
      ~ auto_delete_on_idle                     = "P10675199DT2H48M5.4775807S" -> (known after apply)
      ~ default_message_ttl                     = "P10675199DT2H48M5.4775807S" -> (known after apply)
      ~ duplicate_detection_history_time_window = "PT10M" -> (known after apply)
      - enable_batched_operations               = false -> null
      - enable_express                          = false -> null
      ~ enable_partitioning                     = false -> true # forces replacement
      ~ id                                      = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-data-rg-01/providers/Microsoft.ServiceBus/namespaces/ts-trial-srvb/topics/ts-trial-topic-events" -> (known after apply)
      ~ max_message_size_in_kilobytes           = 1024 -> (known after apply)
      ~ max_size_in_megabytes                   = 81920 -> (known after apply)
        name                                    = "ts-trial-topic-events"
      - requires_duplicate_detection            = false -> null
        # (3 unchanged attributes hidden)
    }

  # module.commons.azurerm_subnet_network_security_group_association.snet_nsg will be destroyed
  # (because azurerm_subnet_network_security_group_association.snet_nsg is not in configuration)
  - resource "azurerm_subnet_network_security_group_association" "snet_nsg" {
      - id                        = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-net-rg-01/providers/Microsoft.Network/virtualNetworks/ts-p-itn-vnet-01/subnets/ts-p-itn-apim-snet-01" -> null
      - network_security_group_id = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-routing-rg-01/providers/Microsoft.Network/networkSecurityGroups/ts-p-itn-apim-nsg" -> null
      - subnet_id                 = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-net-rg-01/providers/Microsoft.Network/virtualNetworks/ts-p-itn-vnet-01/subnets/ts-p-itn-apim-snet-01" -> null
    }

  # module.commons.module.apim.azurerm_api_management.this will be destroyed
  # (because azurerm_api_management.this is not in configuration)
  - resource "azurerm_api_management" "this" {
      - client_certificate_enabled    = false -> null
      - developer_portal_url          = "https://ts-p-itn-apim-01.developer.azure-api.net" -> null
      - gateway_disabled              = false -> null
      - gateway_regional_url          = "https://ts-p-itn-apim-01-italynorth-01.regional.azure-api.net" -> null
      - gateway_url                   = "https://ts-p-itn-apim-01.azure-api.net" -> null
      - id                            = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-routing-rg-01/providers/Microsoft.ApiManagement/service/ts-p-itn-apim-01" -> null
      - location                      = "italynorth" -> null
      - management_api_url            = "https://ts-p-itn-apim-01.management.azure-api.net" -> null
      - name                          = "ts-p-itn-apim-01" -> null
      - notification_sender_email     = "ts-apim@pagopa.it" -> null
      - policy                        = [
          - {
              - xml_content = <<-EOT
                    <!--
                        IMPORTANT:
                        - Policy elements can appear only within the <inbound>, <outbound>, <backend> section elements.
                        - Only the <forward-request> policy element can appear within the <backend> section element.
                        - To apply a policy to the incoming request (before it is forwarded to the backend service), place a corresponding policy element within the <inbound> section element.
                        - To apply a policy to the outgoing response (before it is sent back to the caller), place a corresponding policy element within the <outbound> section element.
                        - To add a policy position the cursor at the desired insertion point and click on the round button associated with the policy.
                        - To remove a policy, delete the corresponding policy statement from the policy document.
                        - Policies are applied in the order of their appearance, from the top down.
                    -->
                    <policies>
                    	<inbound />
                    	<backend>
                    		<forward-request />
                    	</backend>
                    	<outbound />
                    </policies>
                EOT
              - xml_link    = ""
            },
        ] -> null
      - portal_url                    = "https://ts-p-itn-apim-01.portal.azure-api.net" -> null
      - private_ip_addresses          = [] -> null
      - public_ip_addresses           = [
          - "172.213.195.57",
        ] -> null
      - public_network_access_enabled = true -> null
      - publisher_email               = "ts-apim@pagopa.it" -> null
      - publisher_name                = "TRIAL" -> null
      - resource_group_name           = "ts-p-itn-routing-rg-01" -> null
      - scm_url                       = "https://ts-p-itn-apim-01.scm.azure-api.net" -> null
      - sku_name                      = "Developer_1" -> null
      - tags                          = {
          - "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          - "CreatedBy"      = "Terraform"
          - "Environment"    = "Prod"
          - "ManagementTeam" = "IO Platform"
          - "Owner"          = "TRIAL"
          - "Source"         = "https://github.com/pagopa/trial-system"
        } -> null
      - virtual_network_type          = "None" -> null
      - zones                         = [] -> null

      - delegation {
          - subscriptions_enabled     = false -> null
          - user_registration_enabled = false -> null
        }

      - hostname_configuration {
          - proxy {
              - certificate_source           = "BuiltIn" -> null
              - default_ssl_binding          = true -> null
              - host_name                    = "ts-p-itn-apim-01.azure-api.net" -> null
              - negotiate_client_certificate = false -> null
            }
        }

      - identity {
          - identity_ids = [] -> null
          - principal_id = "d1d25fd7-20a7-40b0-becd-9fd86be85d65" -> null
          - tenant_id    = "7788edaf-0346-4068-9d79-c868aed15b3d" -> null
          - type         = "SystemAssigned" -> null
        }

      - protocols {
          - enable_http2 = false -> null
        }

      - security {
          - enable_backend_ssl30                                = false -> null
          - enable_backend_tls10                                = false -> null
          - enable_backend_tls11                                = false -> null
          - enable_frontend_ssl30                               = false -> null
          - enable_frontend_tls10                               = false -> null
          - enable_frontend_tls11                               = false -> null
          - tls_ecdhe_ecdsa_with_aes128_cbc_sha_ciphers_enabled = false -> null
          - tls_ecdhe_ecdsa_with_aes256_cbc_sha_ciphers_enabled = false -> null
          - tls_ecdhe_rsa_with_aes128_cbc_sha_ciphers_enabled   = false -> null
          - tls_ecdhe_rsa_with_aes256_cbc_sha_ciphers_enabled   = false -> null
          - tls_rsa_with_aes128_cbc_sha256_ciphers_enabled      = false -> null
          - tls_rsa_with_aes128_cbc_sha_ciphers_enabled         = false -> null
          - tls_rsa_with_aes128_gcm_sha256_ciphers_enabled      = false -> null
          - tls_rsa_with_aes256_cbc_sha256_ciphers_enabled      = false -> null
          - tls_rsa_with_aes256_cbc_sha_ciphers_enabled         = false -> null
          - tls_rsa_with_aes256_gcm_sha384_ciphers_enabled      = false -> null
          - triple_des_ciphers_enabled                          = false -> null
        }

      - sign_in {
          - enabled = false -> null
        }

      - sign_up {
          - enabled = false -> null

          - terms_of_service {
              - consent_required = false -> null
              - enabled          = false -> null
            }
        }

      - tenant_access {
          - enabled       = false -> null
          - primary_key   = (sensitive value) -> null
          - secondary_key = (sensitive value) -> null
          - tenant_id     = "/tenant/access" -> null
        }
    }

  # module.commons.module.apim.azurerm_api_management_diagnostic.this[0] will be destroyed
  # (because azurerm_api_management_diagnostic.this is not in configuration)
  - resource "azurerm_api_management_diagnostic" "this" {
      - always_log_errors         = true -> null
      - api_management_logger_id  = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-routing-rg-01/providers/Microsoft.ApiManagement/service/ts-p-itn-apim-01/loggers/ts-p-itn-apim-01-logger" -> null
      - api_management_name       = "ts-p-itn-apim-01" -> null
      - http_correlation_protocol = "W3C" -> null
      - id                        = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-routing-rg-01/providers/Microsoft.ApiManagement/service/ts-p-itn-apim-01/diagnostics/applicationinsights" -> null
      - identifier                = "applicationinsights" -> null
      - log_client_ip             = true -> null
      - operation_name_format     = "Name" -> null
      - resource_group_name       = "ts-p-itn-routing-rg-01" -> null
      - sampling_percentage       = 5 -> null
      - verbosity                 = "error" -> null

      - backend_request {
          - body_bytes     = 0 -> null
          - headers_to_log = [] -> null

          - data_masking {
              - query_params {
                  - mode  = "Hide" -> null
                  - value = "*" -> null
                }
            }
        }

      - frontend_request {
          - body_bytes     = 0 -> null
          - headers_to_log = [] -> null

          - data_masking {
              - query_params {
                  - mode  = "Hide" -> null
                  - value = "*" -> null
                }
            }
        }
    }

  # module.commons.module.apim.azurerm_api_management_logger.this[0] will be destroyed
  # (because azurerm_api_management_logger.this is not in configuration)
  - resource "azurerm_api_management_logger" "this" {
      - api_management_name = "ts-p-itn-apim-01" -> null
      - buffered            = true -> null
      - id                  = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-routing-rg-01/providers/Microsoft.ApiManagement/service/ts-p-itn-apim-01/loggers/ts-p-itn-apim-01-logger" -> null
      - name                = "ts-p-itn-apim-01-logger" -> null
      - resource_group_name = "ts-p-itn-routing-rg-01" -> null

      - application_insights {
          - instrumentation_key = (sensitive value) -> null
        }
    }

  # module.commons.module.apim_snet.azurerm_subnet.this will be destroyed
  # (because azurerm_subnet.this is not in configuration)
  - resource "azurerm_subnet" "this" {
      - address_prefixes                               = [
          - "10.30.8.0/24",
        ] -> null
      - enforce_private_link_endpoint_network_policies = false -> null
      - enforce_private_link_service_network_policies  = false -> null
      - id                                             = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-net-rg-01/providers/Microsoft.Network/virtualNetworks/ts-p-itn-vnet-01/subnets/ts-p-itn-apim-snet-01" -> null
      - name                                           = "ts-p-itn-apim-snet-01" -> null
      - private_endpoint_network_policies_enabled      = true -> null
      - private_link_service_network_policies_enabled  = true -> null
      - resource_group_name                            = "ts-p-itn-net-rg-01" -> null
      - service_endpoint_policy_ids                    = [] -> null
      - service_endpoints                              = [] -> null
      - virtual_network_name                           = "ts-p-itn-vnet-01" -> null
    }

  # module.commons.module.subscription_async_fn.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = {
          + "TRIALS_COSMOSDB_CONTAINER_NAME"                                 = "trials"
          + "TRIAL_CONSUMER"                                                 = "on"
            # (34 unchanged elements hidden)
        }
        id                                             = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-async-rg-01/providers/Microsoft.Web/sites/ts-p-itn-subscription-async-fn-01"
        name                                           = "ts-p-itn-subscription-async-fn-01"
        tags                                           = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "Owner"          = "TRIAL"
            "Source"         = "https://github.com/pagopa/trial-system"
        }
        # (27 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.commons.module.subscription_async_fn.azurerm_service_plan.this[0] will be updated in-place
  ~ resource "azurerm_service_plan" "this" {
        id                           = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-async-rg-01/providers/Microsoft.Web/serverFarms/ts-p-itn-subscription-async-fn-01-plan"
        name                         = "ts-p-itn-subscription-async-fn-01-plan"
        tags                         = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "Owner"          = "TRIAL"
            "Source"         = "https://github.com/pagopa/trial-system"
        }
      ~ worker_count                 = 1 -> 2
        # (9 unchanged attributes hidden)
    }

  # module.commons.module.subscription_async_fn_staging_slot.azurerm_linux_function_app_slot.this will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = {
          + "TRIALS_COSMOSDB_CONTAINER_NAME"                                 = "trials"
          + "TRIAL_CONSUMER"                                                 = "on"
            # (34 unchanged elements hidden)
        }
        id                                             = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-async-rg-01/providers/Microsoft.Web/sites/ts-p-itn-subscription-async-fn-01/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "Owner"          = "TRIAL"
            "Source"         = "https://github.com/pagopa/trial-system"
        }
        # (23 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.commons.module.subscription_fn.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = {
          + "TRIALS_COSMOSDB_CONTAINER_NAME"                  = "trials"
          + "TRIAL_CONSUMER"                                  = "off"
            # (30 unchanged elements hidden)
        }
        id                                             = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-subscription-rg-01/providers/Microsoft.Web/sites/ts-p-itn-subscription-fn-01"
        name                                           = "ts-p-itn-subscription-fn-01"
        tags                                           = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "Owner"          = "TRIAL"
            "Source"         = "https://github.com/pagopa/trial-system"
        }
        # (27 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.commons.module.subscription_fn_staging_slot.azurerm_linux_function_app_slot.this will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = {
          + "TRIALS_COSMOSDB_CONTAINER_NAME"                  = "trials"
          + "TRIAL_CONSUMER"                                  = "off"
            # (30 unchanged elements hidden)
        }
        id                                             = "/subscriptions/a2124115-ba74-462f-832a-9192cbd03649/resourceGroups/ts-p-itn-subscription-rg-01/providers/Microsoft.Web/sites/ts-p-itn-subscription-fn-01/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Platform"
            "Owner"          = "TRIAL"
            "Source"         = "https://github.com/pagopa/trial-system"
        }
        # (23 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 5 to add, 6 to change, 14 to destroy.

Warning: Argument is deprecated

  with module.commons.module.key_vault.azurerm_monitor_diagnostic_setting.key_vault,
  on .terraform/modules/commons.key_vault/key_vault/main.tf line 55, in resource "azurerm_monitor_diagnostic_setting" "key_vault":
  55: resource "azurerm_monitor_diagnostic_setting" "key_vault" {

`retention_policy` has been deprecated in favor of
`azurerm_storage_management_policy` resource - to learn more
https://aka.ms/diagnostic_settings_log_retention

(and 2 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
